---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorPosition.FromDataPoint
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorPosition
source: html/883645dc-2e29-663e-00ad-84a32621482c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorPosition.FromDataPoint